codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl020.h
extern volatile __CCP1CON2bits_t CCP1CON2bits __asm__ ("CCP1CON2") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DT:6;
    unsigned :10;
    unsigned PSSBDF:2;
    unsigned PSSACE:2;
    unsigned POLBDF:1;
    unsigned POLACE:1;
    unsigned :2;
    unsigned OUTM:3;
    unsigned :1;
    unsigned OSCNT:3;
    unsigned OETRIG:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP1CON3bits_t;
extern volatile __CCP1CON3bits_t CCP1CON3bits __asm__ ("CCP1CON3") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON3SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON3INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1STAT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICDIS:1;
    unsigned SCEVT:1;
    unsigned ASEVT:1;
    unsigned TRCLR:1;
    unsigned TRSET:1;
    unsigned CCPTRIG:1;
    unsigned :2;
    unsigned ICGARM:1;
    unsigned :5;
    unsigned RAWIP:1;
    unsigned RBWIP:1;
    unsigned TMRLWIP:1;
    unsigned TMRHWIP:1;
    unsigned PRLWIP:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP1STATbits_t;
extern volatile __CCP1STATbits_t CCP1STATbits __asm__ ("CCP1STAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1STATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1STATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1STATINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1TMR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TMRL:16;
    unsigned TMRH:16;
  };
  struct {
    unsigned TMR:32;
  };
} __CCP1TMRbits_t;
extern volatile __CCP1TMRbits_t CCP1TMRbits __asm__ ("CCP1TMR") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1TMRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1TMRSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1TMRINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1PR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PRL:16;
    unsigned PRH:16;
  };
  struct {
    unsigned PR:32;
  };
} __CCP1PRbits_t;
extern volatile __CCP1PRbits_t CCP1PRbits __asm__ ("CCP1PR") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1PRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1PRSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1PRINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RA __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPA:16;
} __CCP1RAbits_t;
extern volatile __CCP1RAbits_t CCP1RAbits __asm__ ("CCP1RA") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RACLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RASET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RAINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RB __attribute__((section("sfrs")));
typedef struct {
  unsigned CMPB:16;
} __CCP1RBbits_t;
extern volatile __CCP1RBbits_t CCP1RBbits __asm__ ("CCP1RB") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1RBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1BUF __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BUFL:16;
    unsigned BUFH:16;
  };
  struct {
    unsigned BUF:32;
  };
} __CCP1BUFbits_t;
extern volatile __CCP1BUFbits_t CCP1BUFbits __asm__ ("CCP1BUF") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1BUFCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1BUFSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1BUFINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MOD:4;
    unsigned CCSEL:1;
    unsigned T32:1;
    unsigned TMRPS:2;
    unsigned CLKSEL:3;
    unsigned TMRSYNC:1;
    unsigned CCPSLP:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned SYNC:5;
    unsigned ALTSYNC:1;
    unsigned ONESHOT:1;
    unsigned TRIGEN:1;
    unsigned OPS:4;
    unsigned :2;
    unsigned RTRGEN:1;
    unsigned OPSSRC:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP2CON1bits_t;
extern volatile __CCP2CON1bits_t CCP2CON1bits __asm__ ("CCP2CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ASDG:8;
    unsigned :4;
    unsigned SSDG:1;
    unsigned :1;
    unsigned ASDGM:1;
    unsigned PWMRSEN:1;
    unsigned ICS:3;
    unsigned AUXOUT:2;
    unsigned :1;
    unsigned ICGSM:2;
    unsigned OCAEN:1;
    unsigned :6;
    unsigned OENSYNC:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP2CON2bits_t;
extern volatile __CCP2CON2bits_t CCP2CON2bits __asm__ ("CCP2CON2") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :18;
    unsigned PSSACE:2;
    unsigned :1;
    unsigned POLACE:1;
    unsigned :6;
    unsigned OSCNT:3;
    unsigned OETRIG:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP2CON3bits_t;
extern volatile __CCP2CON3bits_t CCP2CON3bits __asm__ ("CCP2CON3") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON3SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2CON3INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2STAT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICDIS:1;
    unsigned SCEVT:1;
    unsigned ASEVT:1;
    unsigned TRCLR:1;
    unsigned TRSET:1;
    unsigned CCPTRIG:1;
    unsigned :2;
    unsigned ICGARM:1;
    unsigned :5;
    unsigned RAWIP:1;
    unsigned RBWIP:1;
    unsigned TMRLWIP:1;
    unsigned TMRHWIP:1;
    unsigned PRLWIP:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP2STATbits_t;
extern volatile __CCP2STATbits_t CCP2STATbits __asm__ ("CCP2STAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2STATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2STATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2STATINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP2TMR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TMRL:16;
    unsigned TMRH:16;
  };
  struct {
    unsigned TMR:32;
  };
} __CCP2TMRbits_t;
