codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl020.h
extern volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIE0B0:1;
    unsigned CNIE0B1:1;
    unsigned CNIE0B2:1;
    unsigned :1;
    unsigned CNIE0B4:1;
    unsigned :2;
    unsigned CNIE0B7:1;
    unsigned CNIE0B8:1;
    unsigned CNIE0B9:1;
    unsigned :2;
    unsigned CNIE0B12:1;
    unsigned CNIE0B13:1;
    unsigned CNIE0B14:1;
    unsigned CNIE0B15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNEN0Bbits_t;
extern volatile __CNEN0Bbits_t CNEN0Bbits __asm__ ("CNEN0B") __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATB0:1;
    unsigned CNSTATB1:1;
    unsigned CNSTATB2:1;
    unsigned :1;
    unsigned CNSTATB4:1;
    unsigned :2;
    unsigned CNSTATB7:1;
    unsigned CNSTATB8:1;
    unsigned CNSTATB9:1;
    unsigned :2;
    unsigned CNSTATB12:1;
    unsigned CNSTATB13:1;
    unsigned CNSTATB14:1;
    unsigned CNSTATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATBbits_t;
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIE1B0:1;
    unsigned CNIE1B1:1;
    unsigned CNIE1B2:1;
    unsigned :1;
    unsigned CNIE1B4:1;
    unsigned :2;
    unsigned CNIE1B7:1;
    unsigned CNIE1B8:1;
    unsigned CNIE1B9:1;
    unsigned :2;
    unsigned CNIE1B12:1;
    unsigned CNIE1B13:1;
    unsigned CNIE1B14:1;
    unsigned CNIE1B15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNEN1Bbits_t;
extern volatile __CNEN1Bbits_t CNEN1Bbits __asm__ ("CNEN1B") __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNFB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNFB0:1;
    unsigned CNFB1:1;
    unsigned CNFB2:1;
    unsigned :1;
    unsigned CNFB4:1;
    unsigned :2;
    unsigned CNFB7:1;
    unsigned CNFB8:1;
    unsigned CNFB9:1;
    unsigned :2;
    unsigned CNFB12:1;
    unsigned CNFB13:1;
    unsigned CNFB14:1;
    unsigned CNFB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNFBbits_t;
extern volatile __CNFBbits_t CNFBbits __asm__ ("CNFB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNFBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNFBINV __attribute__((section("sfrs")));
extern volatile unsigned int        SR0B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SR0B0:1;
    unsigned SR0B1:1;
    unsigned SR0B2:1;
    unsigned :1;
    unsigned SR0B4:1;
    unsigned :2;
    unsigned SR0B7:1;
    unsigned SR0B8:1;
    unsigned SR0B9:1;
    unsigned :2;
    unsigned SR0B12:1;
    unsigned SR0B13:1;
    unsigned SR0B14:1;
    unsigned SR0B15:1;
  };
  struct {
    unsigned w:32;
  };
} __SR0Bbits_t;
extern volatile __SR0Bbits_t SR0Bbits __asm__ ("SR0B") __attribute__((section("sfrs")));
extern volatile unsigned int        SR0BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        SR0BSET __attribute__((section("sfrs")));
extern volatile unsigned int        SR0BINV __attribute__((section("sfrs")));
extern volatile unsigned int        SR1B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SR1B0:1;
    unsigned SR1B1:1;
    unsigned SR1B2:1;
    unsigned :1;
    unsigned SR1B4:1;
    unsigned :2;
    unsigned SR1B7:1;
    unsigned SR1B8:1;
    unsigned SR1B9:1;
    unsigned :2;
    unsigned SR1B12:1;
    unsigned SR1B13:1;
    unsigned SR1B14:1;
    unsigned SR1B15:1;
  };
  struct {
    unsigned w:32;
  };
} __SR1Bbits_t;
extern volatile __SR1Bbits_t SR1Bbits __asm__ ("SR1B") __attribute__((section("sfrs")));
extern volatile unsigned int        SR1BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        SR1BSET __attribute__((section("sfrs")));
extern volatile unsigned int        SR1BINV __attribute__((section("sfrs")));
extern volatile unsigned int        PMDCON __attribute__((section("sfrs")));
typedef struct {
  unsigned :11;
  unsigned PMDLOCK:1;
} __PMDCONbits_t;
extern volatile __PMDCONbits_t PMDCONbits __asm__ ("PMDCON") __attribute__((section("sfrs")));
extern volatile unsigned int        PMDCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMDCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        PMDCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        PMD1 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMD:1;
  unsigned :11;
  unsigned VREFMD:1;
  unsigned :7;
  unsigned HLVDMD:1;
} __PMD1bits_t;
extern volatile __PMD1bits_t PMD1bits __asm__ ("PMD1") __attribute__((section("sfrs")));
extern volatile unsigned int        PMD1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMD1SET __attribute__((section("sfrs")));
extern volatile unsigned int        PMD1INV __attribute__((section("sfrs")));
extern volatile unsigned int        PMD2 __attribute__((section("sfrs")));
typedef struct {
  unsigned CMP1MD:1;
  unsigned CMP2MD:1;
  unsigned :22;
  unsigned CLC1MD:1;
  unsigned CLC2MD:1;
} __PMD2bits_t;
extern volatile __PMD2bits_t PMD2bits __asm__ ("PMD2") __attribute__((section("sfrs")));
extern volatile unsigned int        PMD2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMD2SET __attribute__((section("sfrs")));
extern volatile unsigned int        PMD2INV __attribute__((section("sfrs")));
extern volatile unsigned int        PMD3 __attribute__((section("sfrs")));
typedef struct {
  unsigned :8;
  unsigned CCP1MD:1;
  unsigned CCP2MD:1;
  unsigned CCP3MD:1;
} __PMD3bits_t;
extern volatile __PMD3bits_t PMD3bits __asm__ ("PMD3") __attribute__((section("sfrs")));
extern volatile unsigned int        PMD3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMD3SET __attribute__((section("sfrs")));
extern volatile unsigned int        PMD3INV __attribute__((section("sfrs")));
extern volatile unsigned int        PMD4 __attribute__((section("sfrs")));
typedef struct {
  unsigned T1MD:1;
} __PMD4bits_t;
extern volatile __PMD4bits_t PMD4bits __asm__ ("PMD4") __attribute__((section("sfrs")));
extern volatile unsigned int        PMD4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMD4SET __attribute__((section("sfrs")));
extern volatile unsigned int        PMD4INV __attribute__((section("sfrs")));
extern volatile unsigned int        PMD5 __attribute__((section("sfrs")));
typedef struct {
  unsigned U1MD:1;
  unsigned U2MD:1;
  unsigned :6;
  unsigned SPI1MD:1;
  unsigned SPI2MD:1;
  unsigned :6;
  unsigned I2C1MD:1;
  unsigned I2C2MD:1;
} __PMD5bits_t;
extern volatile __PMD5bits_t PMD5bits __asm__ ("PMD5") __attribute__((section("sfrs")));
extern volatile unsigned int        PMD5CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMD5SET __attribute__((section("sfrs")));
extern volatile unsigned int        PMD5INV __attribute__((section("sfrs")));
extern volatile unsigned int        PMD6 __attribute__((section("sfrs")));
typedef struct {
  unsigned RTCCMD:1;
  unsigned :7;
  unsigned REFOMD:1;
} __PMD6bits_t;
extern volatile __PMD6bits_t PMD6bits __asm__ ("PMD6") __attribute__((section("sfrs")));
extern volatile unsigned int        PMD6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMD6SET __attribute__((section("sfrs")));
extern volatile unsigned int        PMD6INV __attribute__((section("sfrs")));
extern volatile unsigned int        PMD7 __attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned CRCMD:1;
} __PMD7bits_t;
extern volatile __PMD7bits_t PMD7bits __asm__ ("PMD7") __attribute__((section("sfrs")));
extern volatile unsigned int        PMD7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PMD7SET __attribute__((section("sfrs")));
extern volatile unsigned int        PMD7INV __attribute__((section("sfrs")));
extern volatile unsigned int        CFGCON __attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned EXECADDR:8;
} __CFGCONbits_t;
extern volatile __CFGCONbits_t CFGCONbits __asm__ ("CFGCON") __attribute__((section("sfrs")));
extern volatile unsigned int        CFGCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CFGCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CFGCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        DEVID __attribute__((section("sfrs")));
typedef struct {
  unsigned MAINID:12;
  unsigned PN:16;
  unsigned VER:4;
} __DEVIDbits_t;
extern volatile __DEVIDbits_t DEVIDbits __asm__ ("DEVID") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVIDCLR __attribute__((section("sfrs")));
extern volatile unsigned int        DEVIDSET __attribute__((section("sfrs")));
extern volatile unsigned int        DEVIDINV __attribute__((section("sfrs")));
extern volatile unsigned int        SYSKEY __attribute__((section("sfrs")));
typedef struct {
  unsigned SYSKEY:32;
} __SYSKEYbits_t;
