codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl020.h
#define _VR1CON_ON_POSITION                      0x0000000F
#define _VR1CON_ON_MASK                          0x00008000
#define _VR1CON_ON_LENGTH                        0x00000001

#define _VR1CON_VRDAT_POSITION                   0x00000010
#define _VR1CON_VRDAT_MASK                       0xFFFF0000
#define _VR1CON_VRDAT_LENGTH                     0x00000010

#define _CRCCON_MOD_POSITION                     0x00000002
#define _CRCCON_MOD_MASK                         0x00000004
#define _CRCCON_MOD_LENGTH                       0x00000001

#define _CRCCON_LENDIAN_POSITION                 0x00000003
#define _CRCCON_LENDIAN_MASK                     0x00000008
#define _CRCCON_LENDIAN_LENGTH                   0x00000001

#define _CRCCON_CRCGO_POSITION                   0x00000004
#define _CRCCON_CRCGO_MASK                       0x00000010
#define _CRCCON_CRCGO_LENGTH                     0x00000001

#define _CRCCON_CRCISEL_POSITION                 0x00000005
#define _CRCCON_CRCISEL_MASK                     0x00000020
#define _CRCCON_CRCISEL_LENGTH                   0x00000001

#define _CRCCON_CRCMPT_POSITION                  0x00000006
#define _CRCCON_CRCMPT_MASK                      0x00000040
#define _CRCCON_CRCMPT_LENGTH                    0x00000001

#define _CRCCON_CRCFUL_POSITION                  0x00000007
#define _CRCCON_CRCFUL_MASK                      0x00000080
#define _CRCCON_CRCFUL_LENGTH                    0x00000001

#define _CRCCON_VWORD_POSITION                   0x00000008
#define _CRCCON_VWORD_MASK                       0x00001F00
#define _CRCCON_VWORD_LENGTH                     0x00000005

#define _CRCCON_SIDL_POSITION                    0x0000000D
#define _CRCCON_SIDL_MASK                        0x00002000
#define _CRCCON_SIDL_LENGTH                      0x00000001

#define _CRCCON_FRZ_POSITION                     0x0000000E
#define _CRCCON_FRZ_MASK                         0x00004000
#define _CRCCON_FRZ_LENGTH                       0x00000001

#define _CRCCON_ON_POSITION                      0x0000000F
#define _CRCCON_ON_MASK                          0x00008000
#define _CRCCON_ON_LENGTH                        0x00000001

#define _CRCCON_PLEN_POSITION                    0x00000010
#define _CRCCON_PLEN_MASK                        0x001F0000
#define _CRCCON_PLEN_LENGTH                      0x00000005

#define _CRCCON_DWIDTH_POSITION                  0x00000018
#define _CRCCON_DWIDTH_MASK                      0x1F000000
#define _CRCCON_DWIDTH_LENGTH                    0x00000005

#define _CRCCON_w_POSITION                       0x00000000
#define _CRCCON_w_MASK                           0xFFFFFFFF
#define _CRCCON_w_LENGTH                         0x00000020

#define _CRCXOR_X1_POSITION                      0x00000001
#define _CRCXOR_X1_MASK                          0x00000002
#define _CRCXOR_X1_LENGTH                        0x00000001

#define _CRCXOR_X2_POSITION                      0x00000002
#define _CRCXOR_X2_MASK                          0x00000004
#define _CRCXOR_X2_LENGTH                        0x00000001

#define _CRCXOR_X3_POSITION                      0x00000003
#define _CRCXOR_X3_MASK                          0x00000008
#define _CRCXOR_X3_LENGTH                        0x00000001

#define _CRCXOR_X4_POSITION                      0x00000004
#define _CRCXOR_X4_MASK                          0x00000010
#define _CRCXOR_X4_LENGTH                        0x00000001

#define _CRCXOR_X5_POSITION                      0x00000005
#define _CRCXOR_X5_MASK                          0x00000020
#define _CRCXOR_X5_LENGTH                        0x00000001

#define _CRCXOR_X6_POSITION                      0x00000006
#define _CRCXOR_X6_MASK                          0x00000040
#define _CRCXOR_X6_LENGTH                        0x00000001

#define _CRCXOR_X7_POSITION                      0x00000007
#define _CRCXOR_X7_MASK                          0x00000080
#define _CRCXOR_X7_LENGTH                        0x00000001

#define _CRCXOR_X8_POSITION                      0x00000008
#define _CRCXOR_X8_MASK                          0x00000100
#define _CRCXOR_X8_LENGTH                        0x00000001

#define _CRCXOR_X9_POSITION                      0x00000009
#define _CRCXOR_X9_MASK                          0x00000200
#define _CRCXOR_X9_LENGTH                        0x00000001

#define _CRCXOR_X10_POSITION                     0x0000000A
#define _CRCXOR_X10_MASK                         0x00000400
#define _CRCXOR_X10_LENGTH                       0x00000001

#define _CRCXOR_X11_POSITION                     0x0000000B
#define _CRCXOR_X11_MASK                         0x00000800
#define _CRCXOR_X11_LENGTH                       0x00000001

#define _CRCXOR_X12_POSITION                     0x0000000C
#define _CRCXOR_X12_MASK                         0x00001000
#define _CRCXOR_X12_LENGTH                       0x00000001

#define _CRCXOR_X13_POSITION                     0x0000000D
#define _CRCXOR_X13_MASK                         0x00002000
#define _CRCXOR_X13_LENGTH                       0x00000001

#define _CRCXOR_X14_POSITION                     0x0000000E
#define _CRCXOR_X14_MASK                         0x00004000
#define _CRCXOR_X14_LENGTH                       0x00000001

#define _CRCXOR_X15_POSITION                     0x0000000F
#define _CRCXOR_X15_MASK                         0x00008000
#define _CRCXOR_X15_LENGTH                       0x00000001

#define _CRCXOR_X16_POSITION                     0x00000010
#define _CRCXOR_X16_MASK                         0x00010000
#define _CRCXOR_X16_LENGTH                       0x00000001

#define _CRCXOR_X17_POSITION                     0x00000011
#define _CRCXOR_X17_MASK                         0x00020000
#define _CRCXOR_X17_LENGTH                       0x00000001

#define _CRCXOR_X18_POSITION                     0x00000012
#define _CRCXOR_X18_MASK                         0x00040000
#define _CRCXOR_X18_LENGTH                       0x00000001

#define _CRCXOR_X19_POSITION                     0x00000013
#define _CRCXOR_X19_MASK                         0x00080000
#define _CRCXOR_X19_LENGTH                       0x00000001

#define _CRCXOR_X20_POSITION                     0x00000014
#define _CRCXOR_X20_MASK                         0x00100000
#define _CRCXOR_X20_LENGTH                       0x00000001

