codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl020.h
#define _CNSTATB_CNSTATB7_POSITION               0x00000007
#define _CNSTATB_CNSTATB7_MASK                   0x00000080
#define _CNSTATB_CNSTATB7_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB8_POSITION               0x00000008
#define _CNSTATB_CNSTATB8_MASK                   0x00000100
#define _CNSTATB_CNSTATB8_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB9_POSITION               0x00000009
#define _CNSTATB_CNSTATB9_MASK                   0x00000200
#define _CNSTATB_CNSTATB9_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB12_POSITION              0x0000000C
#define _CNSTATB_CNSTATB12_MASK                  0x00001000
#define _CNSTATB_CNSTATB12_LENGTH                0x00000001

#define _CNSTATB_CNSTATB13_POSITION              0x0000000D
#define _CNSTATB_CNSTATB13_MASK                  0x00002000
#define _CNSTATB_CNSTATB13_LENGTH                0x00000001

#define _CNSTATB_CNSTATB14_POSITION              0x0000000E
#define _CNSTATB_CNSTATB14_MASK                  0x00004000
#define _CNSTATB_CNSTATB14_LENGTH                0x00000001

#define _CNSTATB_CNSTATB15_POSITION              0x0000000F
#define _CNSTATB_CNSTATB15_MASK                  0x00008000
#define _CNSTATB_CNSTATB15_LENGTH                0x00000001

#define _CNSTATB_w_POSITION                      0x00000000
#define _CNSTATB_w_MASK                          0xFFFFFFFF
#define _CNSTATB_w_LENGTH                        0x00000020

#define _CNEN1B_CNIE1B0_POSITION                 0x00000000
#define _CNEN1B_CNIE1B0_MASK                     0x00000001
#define _CNEN1B_CNIE1B0_LENGTH                   0x00000001

#define _CNEN1B_CNIE1B1_POSITION                 0x00000001
#define _CNEN1B_CNIE1B1_MASK                     0x00000002
#define _CNEN1B_CNIE1B1_LENGTH                   0x00000001

#define _CNEN1B_CNIE1B2_POSITION                 0x00000002
#define _CNEN1B_CNIE1B2_MASK                     0x00000004
#define _CNEN1B_CNIE1B2_LENGTH                   0x00000001

#define _CNEN1B_CNIE1B4_POSITION                 0x00000004
#define _CNEN1B_CNIE1B4_MASK                     0x00000010
#define _CNEN1B_CNIE1B4_LENGTH                   0x00000001

#define _CNEN1B_CNIE1B7_POSITION                 0x00000007
#define _CNEN1B_CNIE1B7_MASK                     0x00000080
#define _CNEN1B_CNIE1B7_LENGTH                   0x00000001

#define _CNEN1B_CNIE1B8_POSITION                 0x00000008
#define _CNEN1B_CNIE1B8_MASK                     0x00000100
#define _CNEN1B_CNIE1B8_LENGTH                   0x00000001

#define _CNEN1B_CNIE1B9_POSITION                 0x00000009
#define _CNEN1B_CNIE1B9_MASK                     0x00000200
#define _CNEN1B_CNIE1B9_LENGTH                   0x00000001

#define _CNEN1B_CNIE1B12_POSITION                0x0000000C
#define _CNEN1B_CNIE1B12_MASK                    0x00001000
#define _CNEN1B_CNIE1B12_LENGTH                  0x00000001

#define _CNEN1B_CNIE1B13_POSITION                0x0000000D
#define _CNEN1B_CNIE1B13_MASK                    0x00002000
#define _CNEN1B_CNIE1B13_LENGTH                  0x00000001

#define _CNEN1B_CNIE1B14_POSITION                0x0000000E
#define _CNEN1B_CNIE1B14_MASK                    0x00004000
#define _CNEN1B_CNIE1B14_LENGTH                  0x00000001

#define _CNEN1B_CNIE1B15_POSITION                0x0000000F
#define _CNEN1B_CNIE1B15_MASK                    0x00008000
#define _CNEN1B_CNIE1B15_LENGTH                  0x00000001

#define _CNEN1B_w_POSITION                       0x00000000
#define _CNEN1B_w_MASK                           0xFFFFFFFF
#define _CNEN1B_w_LENGTH                         0x00000020

#define _CNFB_CNFB0_POSITION                     0x00000000
#define _CNFB_CNFB0_MASK                         0x00000001
#define _CNFB_CNFB0_LENGTH                       0x00000001

#define _CNFB_CNFB1_POSITION                     0x00000001
#define _CNFB_CNFB1_MASK                         0x00000002
#define _CNFB_CNFB1_LENGTH                       0x00000001

#define _CNFB_CNFB2_POSITION                     0x00000002
#define _CNFB_CNFB2_MASK                         0x00000004
#define _CNFB_CNFB2_LENGTH                       0x00000001

#define _CNFB_CNFB4_POSITION                     0x00000004
#define _CNFB_CNFB4_MASK                         0x00000010
#define _CNFB_CNFB4_LENGTH                       0x00000001

#define _CNFB_CNFB7_POSITION                     0x00000007
#define _CNFB_CNFB7_MASK                         0x00000080
#define _CNFB_CNFB7_LENGTH                       0x00000001

#define _CNFB_CNFB8_POSITION                     0x00000008
#define _CNFB_CNFB8_MASK                         0x00000100
#define _CNFB_CNFB8_LENGTH                       0x00000001

#define _CNFB_CNFB9_POSITION                     0x00000009
#define _CNFB_CNFB9_MASK                         0x00000200
#define _CNFB_CNFB9_LENGTH                       0x00000001

#define _CNFB_CNFB12_POSITION                    0x0000000C
#define _CNFB_CNFB12_MASK                        0x00001000
#define _CNFB_CNFB12_LENGTH                      0x00000001

#define _CNFB_CNFB13_POSITION                    0x0000000D
#define _CNFB_CNFB13_MASK                        0x00002000
#define _CNFB_CNFB13_LENGTH                      0x00000001

#define _CNFB_CNFB14_POSITION                    0x0000000E
#define _CNFB_CNFB14_MASK                        0x00004000
#define _CNFB_CNFB14_LENGTH                      0x00000001

#define _CNFB_CNFB15_POSITION                    0x0000000F
#define _CNFB_CNFB15_MASK                        0x00008000
#define _CNFB_CNFB15_LENGTH                      0x00000001

#define _CNFB_w_POSITION                         0x00000000
#define _CNFB_w_MASK                             0xFFFFFFFF
#define _CNFB_w_LENGTH                           0x00000020

#define _SR0B_SR0B0_POSITION                     0x00000000
#define _SR0B_SR0B0_MASK                         0x00000001
#define _SR0B_SR0B0_LENGTH                       0x00000001

#define _SR0B_SR0B1_POSITION                     0x00000001
#define _SR0B_SR0B1_MASK                         0x00000002
#define _SR0B_SR0B1_LENGTH                       0x00000001

#define _SR0B_SR0B2_POSITION                     0x00000002
#define _SR0B_SR0B2_MASK                         0x00000004
#define _SR0B_SR0B2_LENGTH                       0x00000001

#define _SR0B_SR0B4_POSITION                     0x00000004
#define _SR0B_SR0B4_MASK                         0x00000010
#define _SR0B_SR0B4_LENGTH                       0x00000001

#define _SR0B_SR0B7_POSITION                     0x00000007
#define _SR0B_SR0B7_MASK                         0x00000080
#define _SR0B_SR0B7_LENGTH                       0x00000001

#define _SR0B_SR0B8_POSITION                     0x00000008
#define _SR0B_SR0B8_MASK                         0x00000100
#define _SR0B_SR0B8_LENGTH                       0x00000001

#define _SR0B_SR0B9_POSITION                     0x00000009
#define _SR0B_SR0B9_MASK                         0x00000200
#define _SR0B_SR0B9_LENGTH                       0x00000001

#define _SR0B_SR0B12_POSITION                    0x0000000C
#define _SR0B_SR0B12_MASK                        0x00001000
#define _SR0B_SR0B12_LENGTH                      0x00000001

#define _SR0B_SR0B13_POSITION                    0x0000000D
#define _SR0B_SR0B13_MASK                        0x00002000
#define _SR0B_SR0B13_LENGTH                      0x00000001

