codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl020.h
#define _SR0B_SR0B14_POSITION                    0x0000000E
#define _SR0B_SR0B14_MASK                        0x00004000
#define _SR0B_SR0B14_LENGTH                      0x00000001

#define _SR0B_SR0B15_POSITION                    0x0000000F
#define _SR0B_SR0B15_MASK                        0x00008000
#define _SR0B_SR0B15_LENGTH                      0x00000001

#define _SR0B_w_POSITION                         0x00000000
#define _SR0B_w_MASK                             0xFFFFFFFF
#define _SR0B_w_LENGTH                           0x00000020

#define _SR1B_SR1B0_POSITION                     0x00000000
#define _SR1B_SR1B0_MASK                         0x00000001
#define _SR1B_SR1B0_LENGTH                       0x00000001

#define _SR1B_SR1B1_POSITION                     0x00000001
#define _SR1B_SR1B1_MASK                         0x00000002
#define _SR1B_SR1B1_LENGTH                       0x00000001

#define _SR1B_SR1B2_POSITION                     0x00000002
#define _SR1B_SR1B2_MASK                         0x00000004
#define _SR1B_SR1B2_LENGTH                       0x00000001

#define _SR1B_SR1B4_POSITION                     0x00000004
#define _SR1B_SR1B4_MASK                         0x00000010
#define _SR1B_SR1B4_LENGTH                       0x00000001

#define _SR1B_SR1B7_POSITION                     0x00000007
#define _SR1B_SR1B7_MASK                         0x00000080
#define _SR1B_SR1B7_LENGTH                       0x00000001

#define _SR1B_SR1B8_POSITION                     0x00000008
#define _SR1B_SR1B8_MASK                         0x00000100
#define _SR1B_SR1B8_LENGTH                       0x00000001

#define _SR1B_SR1B9_POSITION                     0x00000009
#define _SR1B_SR1B9_MASK                         0x00000200
#define _SR1B_SR1B9_LENGTH                       0x00000001

#define _SR1B_SR1B12_POSITION                    0x0000000C
#define _SR1B_SR1B12_MASK                        0x00001000
#define _SR1B_SR1B12_LENGTH                      0x00000001

#define _SR1B_SR1B13_POSITION                    0x0000000D
#define _SR1B_SR1B13_MASK                        0x00002000
#define _SR1B_SR1B13_LENGTH                      0x00000001

#define _SR1B_SR1B14_POSITION                    0x0000000E
#define _SR1B_SR1B14_MASK                        0x00004000
#define _SR1B_SR1B14_LENGTH                      0x00000001

#define _SR1B_SR1B15_POSITION                    0x0000000F
#define _SR1B_SR1B15_MASK                        0x00008000
#define _SR1B_SR1B15_LENGTH                      0x00000001

#define _SR1B_w_POSITION                         0x00000000
#define _SR1B_w_MASK                             0xFFFFFFFF
#define _SR1B_w_LENGTH                           0x00000020

#define _PMDCON_PMDLOCK_POSITION                 0x0000000B
#define _PMDCON_PMDLOCK_MASK                     0x00000800
#define _PMDCON_PMDLOCK_LENGTH                   0x00000001

#define _PMD1_ADCMD_POSITION                     0x00000000
#define _PMD1_ADCMD_MASK                         0x00000001
#define _PMD1_ADCMD_LENGTH                       0x00000001

#define _PMD1_VREFMD_POSITION                    0x0000000C
#define _PMD1_VREFMD_MASK                        0x00001000
#define _PMD1_VREFMD_LENGTH                      0x00000001

#define _PMD1_HLVDMD_POSITION                    0x00000014
#define _PMD1_HLVDMD_MASK                        0x00100000
#define _PMD1_HLVDMD_LENGTH                      0x00000001

#define _PMD2_CMP1MD_POSITION                    0x00000000
#define _PMD2_CMP1MD_MASK                        0x00000001
#define _PMD2_CMP1MD_LENGTH                      0x00000001

#define _PMD2_CMP2MD_POSITION                    0x00000001
#define _PMD2_CMP2MD_MASK                        0x00000002
#define _PMD2_CMP2MD_LENGTH                      0x00000001

#define _PMD2_CLC1MD_POSITION                    0x00000018
#define _PMD2_CLC1MD_MASK                        0x01000000
#define _PMD2_CLC1MD_LENGTH                      0x00000001

#define _PMD2_CLC2MD_POSITION                    0x00000019
#define _PMD2_CLC2MD_MASK                        0x02000000
#define _PMD2_CLC2MD_LENGTH                      0x00000001

#define _PMD3_CCP1MD_POSITION                    0x00000008
#define _PMD3_CCP1MD_MASK                        0x00000100
#define _PMD3_CCP1MD_LENGTH                      0x00000001

#define _PMD3_CCP2MD_POSITION                    0x00000009
#define _PMD3_CCP2MD_MASK                        0x00000200
#define _PMD3_CCP2MD_LENGTH                      0x00000001

#define _PMD3_CCP3MD_POSITION                    0x0000000A
#define _PMD3_CCP3MD_MASK                        0x00000400
#define _PMD3_CCP3MD_LENGTH                      0x00000001

#define _PMD4_T1MD_POSITION                      0x00000000
#define _PMD4_T1MD_MASK                          0x00000001
#define _PMD4_T1MD_LENGTH                        0x00000001

#define _PMD5_U1MD_POSITION                      0x00000000
#define _PMD5_U1MD_MASK                          0x00000001
#define _PMD5_U1MD_LENGTH                        0x00000001

#define _PMD5_U2MD_POSITION                      0x00000001
#define _PMD5_U2MD_MASK                          0x00000002
#define _PMD5_U2MD_LENGTH                        0x00000001

#define _PMD5_SPI1MD_POSITION                    0x00000008
#define _PMD5_SPI1MD_MASK                        0x00000100
#define _PMD5_SPI1MD_LENGTH                      0x00000001

#define _PMD5_SPI2MD_POSITION                    0x00000009
#define _PMD5_SPI2MD_MASK                        0x00000200
#define _PMD5_SPI2MD_LENGTH                      0x00000001

#define _PMD5_I2C1MD_POSITION                    0x00000010
#define _PMD5_I2C1MD_MASK                        0x00010000
#define _PMD5_I2C1MD_LENGTH                      0x00000001

#define _PMD5_I2C2MD_POSITION                    0x00000011
#define _PMD5_I2C2MD_MASK                        0x00020000
#define _PMD5_I2C2MD_LENGTH                      0x00000001

#define _PMD6_RTCCMD_POSITION                    0x00000000
#define _PMD6_RTCCMD_MASK                        0x00000001
#define _PMD6_RTCCMD_LENGTH                      0x00000001

