codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl020.h
#define _IFS0_INT4IF_POSITION                    0x00000007
#define _IFS0_INT4IF_MASK                        0x00000080
#define _IFS0_INT4IF_LENGTH                      0x00000001

#define _IFS0_CNAIF_POSITION                     0x00000008
#define _IFS0_CNAIF_MASK                         0x00000100
#define _IFS0_CNAIF_LENGTH                       0x00000001

#define _IFS0_CNBIF_POSITION                     0x00000009
#define _IFS0_CNBIF_MASK                         0x00000200
#define _IFS0_CNBIF_LENGTH                       0x00000001

#define _IFS0_CNCIF_POSITION                     0x0000000A
#define _IFS0_CNCIF_MASK                         0x00000400
#define _IFS0_CNCIF_LENGTH                       0x00000001

#define _IFS0_T1IF_POSITION                      0x0000000B
#define _IFS0_T1IF_MASK                          0x00000800
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_CMP1IF_POSITION                    0x0000000C
#define _IFS0_CMP1IF_MASK                        0x00001000
#define _IFS0_CMP1IF_LENGTH                      0x00000001

#define _IFS0_CMP2IF_POSITION                    0x0000000D
#define _IFS0_CMP2IF_MASK                        0x00002000
#define _IFS0_CMP2IF_LENGTH                      0x00000001

#define _IFS0_RTCCIF_POSITION                    0x0000000E
#define _IFS0_RTCCIF_MASK                        0x00004000
#define _IFS0_RTCCIF_LENGTH                      0x00000001

#define _IFS0_AD1IF_POSITION                     0x0000000F
#define _IFS0_AD1IF_MASK                         0x00008000
#define _IFS0_AD1IF_LENGTH                       0x00000001

#define _IFS0_CRCIF_POSITION                     0x00000010
#define _IFS0_CRCIF_MASK                         0x00010000
#define _IFS0_CRCIF_LENGTH                       0x00000001

#define _IFS0_LVDIF_POSITION                     0x00000011
#define _IFS0_LVDIF_MASK                         0x00020000
#define _IFS0_LVDIF_LENGTH                       0x00000001

#define _IFS0_CLC1IF_POSITION                    0x00000012
#define _IFS0_CLC1IF_MASK                        0x00040000
#define _IFS0_CLC1IF_LENGTH                      0x00000001

#define _IFS0_CLC2IF_POSITION                    0x00000013
#define _IFS0_CLC2IF_MASK                        0x00080000
#define _IFS0_CLC2IF_LENGTH                      0x00000001

#define _IFS0_SPI1EIF_POSITION                   0x00000014
#define _IFS0_SPI1EIF_MASK                       0x00100000
#define _IFS0_SPI1EIF_LENGTH                     0x00000001

#define _IFS0_SPI1TXIF_POSITION                  0x00000015
#define _IFS0_SPI1TXIF_MASK                      0x00200000
#define _IFS0_SPI1TXIF_LENGTH                    0x00000001

#define _IFS0_SPI1RXIF_POSITION                  0x00000016
#define _IFS0_SPI1RXIF_MASK                      0x00400000
#define _IFS0_SPI1RXIF_LENGTH                    0x00000001

#define _IFS0_U1RXIF_POSITION                    0x00000017
#define _IFS0_U1RXIF_MASK                        0x00800000
#define _IFS0_U1RXIF_LENGTH                      0x00000001

#define _IFS0_U1TXIF_POSITION                    0x00000018
#define _IFS0_U1TXIF_MASK                        0x01000000
#define _IFS0_U1TXIF_LENGTH                      0x00000001

#define _IFS0_U1EIF_POSITION                     0x00000019
#define _IFS0_U1EIF_MASK                         0x02000000
#define _IFS0_U1EIF_LENGTH                       0x00000001

#define _IFS0_I2C1SIF_POSITION                   0x0000001A
#define _IFS0_I2C1SIF_MASK                       0x04000000
#define _IFS0_I2C1SIF_LENGTH                     0x00000001

#define _IFS0_I2C1MIF_POSITION                   0x0000001B
#define _IFS0_I2C1MIF_MASK                       0x08000000
#define _IFS0_I2C1MIF_LENGTH                     0x00000001

#define _IFS0_I2C1BCIF_POSITION                  0x0000001C
#define _IFS0_I2C1BCIF_MASK                      0x10000000
#define _IFS0_I2C1BCIF_LENGTH                    0x00000001

#define _IFS0_CCP1IF_POSITION                    0x0000001D
#define _IFS0_CCP1IF_MASK                        0x20000000
#define _IFS0_CCP1IF_LENGTH                      0x00000001

#define _IFS0_CCT1IF_POSITION                    0x0000001E
#define _IFS0_CCT1IF_MASK                        0x40000000
#define _IFS0_CCT1IF_LENGTH                      0x00000001

#define _IFS0_CCP2IF_POSITION                    0x0000001F
#define _IFS0_CCP2IF_MASK                        0x80000000
#define _IFS0_CCP2IF_LENGTH                      0x00000001

#define _IFS0_w_POSITION                         0x00000000
#define _IFS0_w_MASK                             0xFFFFFFFF
#define _IFS0_w_LENGTH                           0x00000020

#define _IFS1_CCT2IF_POSITION                    0x00000000
#define _IFS1_CCT2IF_MASK                        0x00000001
#define _IFS1_CCT2IF_LENGTH                      0x00000001

#define _IFS1_CCP3IF_POSITION                    0x00000001
#define _IFS1_CCP3IF_MASK                        0x00000002
#define _IFS1_CCP3IF_LENGTH                      0x00000001

#define _IFS1_CCT3IF_POSITION                    0x00000002
#define _IFS1_CCT3IF_MASK                        0x00000004
#define _IFS1_CCT3IF_LENGTH                      0x00000001

#define _IFS1_SPI2EIF_POSITION                   0x00000005
#define _IFS1_SPI2EIF_MASK                       0x00000020
#define _IFS1_SPI2EIF_LENGTH                     0x00000001

#define _IFS1_SPI2TXIF_POSITION                  0x00000006
#define _IFS1_SPI2TXIF_MASK                      0x00000040
#define _IFS1_SPI2TXIF_LENGTH                    0x00000001

#define _IFS1_SPI2RXIF_POSITION                  0x00000007
#define _IFS1_SPI2RXIF_MASK                      0x00000080
#define _IFS1_SPI2RXIF_LENGTH                    0x00000001

#define _IFS1_U2RXIF_POSITION                    0x00000008
#define _IFS1_U2RXIF_MASK                        0x00000100
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x00000009
#define _IFS1_U2TXIF_MASK                        0x00000200
#define _IFS1_U2TXIF_LENGTH                      0x00000001

