codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl020.h
#define _IPC1_INT4IS_POSITION                    0x00000018
#define _IPC1_INT4IS_MASK                        0x03000000
#define _IPC1_INT4IS_LENGTH                      0x00000002

#define _IPC1_INT4IP_POSITION                    0x0000001A
#define _IPC1_INT4IP_MASK                        0x1C000000
#define _IPC1_INT4IP_LENGTH                      0x00000003

#define _IPC1_w_POSITION                         0x00000000
#define _IPC1_w_MASK                             0xFFFFFFFF
#define _IPC1_w_LENGTH                           0x00000020

#define _IPC2_CNAIS_POSITION                     0x00000000
#define _IPC2_CNAIS_MASK                         0x00000003
#define _IPC2_CNAIS_LENGTH                       0x00000002

#define _IPC2_CNAIP_POSITION                     0x00000002
#define _IPC2_CNAIP_MASK                         0x0000001C
#define _IPC2_CNAIP_LENGTH                       0x00000003

#define _IPC2_CNBIS_POSITION                     0x00000008
#define _IPC2_CNBIS_MASK                         0x00000300
#define _IPC2_CNBIS_LENGTH                       0x00000002

#define _IPC2_CNBIP_POSITION                     0x0000000A
#define _IPC2_CNBIP_MASK                         0x00001C00
#define _IPC2_CNBIP_LENGTH                       0x00000003

#define _IPC2_CNCIS_POSITION                     0x00000010
#define _IPC2_CNCIS_MASK                         0x00030000
#define _IPC2_CNCIS_LENGTH                       0x00000002

#define _IPC2_CNCIP_POSITION                     0x00000012
#define _IPC2_CNCIP_MASK                         0x001C0000
#define _IPC2_CNCIP_LENGTH                       0x00000003

#define _IPC2_T1IS_POSITION                      0x00000018
#define _IPC2_T1IS_MASK                          0x03000000
#define _IPC2_T1IS_LENGTH                        0x00000002

#define _IPC2_T1IP_POSITION                      0x0000001A
#define _IPC2_T1IP_MASK                          0x1C000000
#define _IPC2_T1IP_LENGTH                        0x00000003

#define _IPC2_w_POSITION                         0x00000000
#define _IPC2_w_MASK                             0xFFFFFFFF
#define _IPC2_w_LENGTH                           0x00000020

#define _IPC3_CMP1IS_POSITION                    0x00000000
#define _IPC3_CMP1IS_MASK                        0x00000003
#define _IPC3_CMP1IS_LENGTH                      0x00000002

#define _IPC3_CMP1IP_POSITION                    0x00000002
#define _IPC3_CMP1IP_MASK                        0x0000001C
#define _IPC3_CMP1IP_LENGTH                      0x00000003

#define _IPC3_CMP2IS_POSITION                    0x00000008
#define _IPC3_CMP2IS_MASK                        0x00000300
#define _IPC3_CMP2IS_LENGTH                      0x00000002

#define _IPC3_CMP2IP_POSITION                    0x0000000A
#define _IPC3_CMP2IP_MASK                        0x00001C00
#define _IPC3_CMP2IP_LENGTH                      0x00000003

#define _IPC3_RTCCIS_POSITION                    0x00000010
#define _IPC3_RTCCIS_MASK                        0x00030000
#define _IPC3_RTCCIS_LENGTH                      0x00000002

#define _IPC3_RTCCIP_POSITION                    0x00000012
#define _IPC3_RTCCIP_MASK                        0x001C0000
#define _IPC3_RTCCIP_LENGTH                      0x00000003

#define _IPC3_AD1IS_POSITION                     0x00000018
#define _IPC3_AD1IS_MASK                         0x03000000
#define _IPC3_AD1IS_LENGTH                       0x00000002

#define _IPC3_AD1IP_POSITION                     0x0000001A
#define _IPC3_AD1IP_MASK                         0x1C000000
#define _IPC3_AD1IP_LENGTH                       0x00000003

#define _IPC3_w_POSITION                         0x00000000
#define _IPC3_w_MASK                             0xFFFFFFFF
#define _IPC3_w_LENGTH                           0x00000020

#define _IPC4_CRCIS_POSITION                     0x00000000
#define _IPC4_CRCIS_MASK                         0x00000003
#define _IPC4_CRCIS_LENGTH                       0x00000002

#define _IPC4_CRCIP_POSITION                     0x00000002
#define _IPC4_CRCIP_MASK                         0x0000001C
#define _IPC4_CRCIP_LENGTH                       0x00000003

#define _IPC4_LVDIS_POSITION                     0x00000008
#define _IPC4_LVDIS_MASK                         0x00000300
#define _IPC4_LVDIS_LENGTH                       0x00000002

#define _IPC4_LVDIP_POSITION                     0x0000000A
#define _IPC4_LVDIP_MASK                         0x00001C00
#define _IPC4_LVDIP_LENGTH                       0x00000003

#define _IPC4_CLC1IS_POSITION                    0x00000010
#define _IPC4_CLC1IS_MASK                        0x00030000
#define _IPC4_CLC1IS_LENGTH                      0x00000002

#define _IPC4_CLC1IP_POSITION                    0x00000012
#define _IPC4_CLC1IP_MASK                        0x001C0000
#define _IPC4_CLC1IP_LENGTH                      0x00000003

#define _IPC4_CLC2IS_POSITION                    0x00000018
#define _IPC4_CLC2IS_MASK                        0x03000000
#define _IPC4_CLC2IS_LENGTH                      0x00000002

#define _IPC4_CLC2IP_POSITION                    0x0000001A
#define _IPC4_CLC2IP_MASK                        0x1C000000
#define _IPC4_CLC2IP_LENGTH                      0x00000003

#define _IPC4_w_POSITION                         0x00000000
#define _IPC4_w_MASK                             0xFFFFFFFF
#define _IPC4_w_LENGTH                           0x00000020

#define _IPC5_SPI1EIS_POSITION                   0x00000000
#define _IPC5_SPI1EIS_MASK                       0x00000003
#define _IPC5_SPI1EIS_LENGTH                     0x00000002

#define _IPC5_SPI1EIP_POSITION                   0x00000002
#define _IPC5_SPI1EIP_MASK                       0x0000001C
#define _IPC5_SPI1EIP_LENGTH                     0x00000003

#define _IPC5_SPI1TXIS_POSITION                  0x00000008
#define _IPC5_SPI1TXIS_MASK                      0x00000300
#define _IPC5_SPI1TXIS_LENGTH                    0x00000002

#define _IPC5_SPI1TXIP_POSITION                  0x0000000A
#define _IPC5_SPI1TXIP_MASK                      0x00001C00
#define _IPC5_SPI1TXIP_LENGTH                    0x00000003

